Revit 2027 API
PolyLine.GetCoordinates Method
Gets the coordinate points of the polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetCoordinates()
Public Function GetCoordinates As IList(Of XYZ)
public:
IList<XYZ^>^ GetCoordinates()
member GetCoordinates : unit -> IList<XYZ>
Return Value
IList<XYZ>
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace